<template>
    <div class="container">
    <h1 class="title">Криптосистема на конечных полях</h1>
    <img class="image" src="@/assets/ShifrAssets/KPole.jpg">
    <div class="text">
    <h2>Что такое конечные поля GF(2^n)?</h2>
    <p>Конечные поля GF(2^n) (или поля Галуа) представляют собой математическую алгебраическую структуру, в которой операции сложения и умножения определены для элементов, принимающих значения 0 или 1. Они находят широкое применение в криптографии, так как позволяют эффективно реализовывать различные алгоритмы шифрования.</p>

    <h2>Зачем используются конечные поля в криптографии?</h2>
    <p>Конечные поля позволяют достичь высокой стойкости криптографических систем, обеспечивая эффективное перемешивание и обработку данных. Они позволяют создавать сложные криптографические операции, такие как нелинейные подстановки и перестановки, что делает алгоритмы шифрования более надежными.</p>

    <h2>Принцип работы</h2>
    <p>Криптосистемы на конечных полях GF(2^n) используют элементы этого поля для представления данных и ключей. Основные операции - сложение и умножение элементов поля.</p>

    <h2>Ключевые понятия</h2>
    <ul>
        <li>Элементы конечного поля: числа, представляющие символы алфавита.</li>
        <li>Аддитивная и мультипликативная группы поля: подмножества элементов, для которых определены операции сложения и умножения.</li>
        <li>Неприводимые многочлены: многочлены, которые нельзя разложить на множители меньшей степени.</li>
    </ul>

    <h2>Описание алгоритма</h2>
    <ol>
        <li><strong>Генерация ключей:</strong> Выбор неприводимого многочлена и начального ключа для генерации раундовых ключей.</li>
        <li><strong>Шифрование:</strong>
            <ul>
                <li><strong>Исходные данные:</strong> Разбиение открытого текста на блоки и их представление в виде элементов поля.</li>
                <li><strong>Добавление ключа:</strong> Поблочное сложение блока открытого текста с раундовым ключом.</li>
                <li><strong>Нелинейное преобразование:</strong> Применение нелинейной S-блока для обеспечения стойкости.</li>
                <li><strong>Перестановка:</strong> Перестановка элементов блока для перемешивания данных.</li>
                <li><strong>Умножение на ключ:</strong> Умножение блока на раундовый ключ для дополнительной защиты.</li>
            </ul>
        </li>
    </ol>

    <h2>Пример работы алгоритма</h2>
    <ol>
        <li><strong>Генерация ключей:</strong> Выбран неприводимый многочлен x^3 + x + 1 и начальный ключ 110.</li>
        <li><strong>Шифрование:</strong>
            <ul>
                <li><strong>Исходные данные:</strong> Открытый текст "1010" представлен как элементы поля: [1, 0, 1, 0].</li>
                <li><strong>Добавление ключа:</strong> [1, 0, 1, 0] + [1, 1, 0] = [0, 1, 1, 0].</li>
                <li><strong>Нелинейное преобразование:</strong> Применение S-блока: [0, 1, 1, 0] -> [1, 0, 1, 1].</li>
                <li><strong>Перестановка:</strong> Перестановка элементов: [1, 0, 1, 1] -> [0, 1, 1, 1].</li>
                <li><strong>Умножение на ключ:</strong> [0, 1, 1, 1] * [1, 1, 0] = [1, 0, 1].</li>
                <li><strong>Шифрованный текст:</strong> [1, 0, 1].</li>
            </ul>
        </li>
    </ol>

    <h2>Преимущества</h2>
    <ul>
        <li><strong>Стойкость:</strong> Применение нелинейных операций и сложных математических преобразований обеспечивает высокую стойкость к взлому.</li>
        <li><strong>Эффективность:</strong> Операции на конечных полях GF(2^n) можно реализовать эффективно, что позволяет достичь высокой производительности.</li>
    </ul>

    <h2>Недостатки</h2>
    <ul>
        <li><strong>Сложность реализации:</strong> Реализация алгоритмов на конечных полях требует глубокого понимания математических концепций и вычислительных операций.</li>
        <li><strong>Ограниченные выборы параметров:</strong> Выбор подходящих неприводимых многочленов и других параметров может оказаться сложным.</li>
    </ul>  
    </div> 
    </div>   
    </template>
    <script>
    </script>
    <style scoped>
    .container {
      margin-right: 20px;
      margin-left: 20px;
      overflow: auto;
    }
    
    .image {
      float: right;
      margin-right: 20px;
      margin-left: 20px;
      max-width: 40%;
    }
    .title {
        font-size: 36px;
        font-weight: bold;
        margin-bottom: 16px;
        text-align: center;
    }
    
    .text {
      font-size: 18px;
      line-height: 1.5;
      text-align: left;
    }
    </style>