<template>
    <div class="container">
    <h1 class="title">Матричное шифрование и дешифрование</h1>
    <img class="image" src="@/assets/ShifrAssets/Matrix.jpg">
    <div class="text">
<ul>
<li><strong>Обратная матрица:</strong> Матрица, которая умножается на исходную матрицу таким образом, что их произведение равно единичной матрице.</li>
<li><strong>Модуль:</strong> Целое число, по которому производятся вычисления в арифметике по модулю.</li>
</ul>

<h2>Алгоритм шифрования и дешифрования с обратной матрицей</h2>
<p><strong>Шаг 1:</strong> Генерация ключей</p>
<ol>
<li>Выберите случайную квадратную матрицу A определенного размера.</li>
<li>Вычислите обратную матрицу A<sup>-1</sup> любым известным способом (Например методом Гаусса).</li>
</ol>

<p><strong>Шаг 2:</strong> Шифрование</p>
<ol>
<li>Представьте открытый текст в виде матрицы X, где каждая буква заменяется числом (например, A=0, B=1 и т.д.).</li>
<li>Вычислите шифрованный текст Y = AX, где Y - матрица шифрованного текста.</li>
</ol>

<p><strong>Шаг 3:</strong> Дешифрование</p>
<ol>
<li>Вычислите обратную матрицу A<sup>-1</sup>.</li>
<li>Умножьте шифрованный текст Y на обратную матрицу A<sup>-1</sup>: X = A<sup>-1</sup> * Y.</li>
</ol>

<h1>Пример</h1>
  
  <h2>Шаг 1: Генерация ключей</h2>
  <p>Пусть ключевая матрица A имеет следующий вид:</p>
  <pre>
  A = | 1 0 |
      | 1 1 |
  </pre>
  <p>Вычислим обратную матрицу A^-1:</p>
  <pre>
  A^-1 = | 1 0 |
         | 1 1 |
  </pre>
  
  <h2>Шаг 2: Шифрование</h2>
  <p>Предположим, у нас есть открытый текст в бинарном виде: "1010". Мы представляем его как матрицу:</p>
  <pre>
  X = | 1 0 |
      | 1 0 |
  </pre>
  <p>Вычислим шифрованный текст Y = AX:</p>
  <pre>
  Y = AX = | 1*1+0*1  0*0+0*1 |
           | 1*1+1*1  0*0+1*1 |
         = | 1 0 |
           | 0 1 |
  </pre>
  
  <h2>Шаг 3: Дешифрование</h2>
  <p>Вычислим дешифрованный текст, умножив шифрованный текст на обратную матрицу A^-1:</p>
  <pre>
  Y = | 1 0 |
      | 0 1 |

  X = A^-1 * Y = | 1*1+0*0  0*0+0*1 |
                | 1*0+1*1  0*0+1*1 |
              = | 1 0 |
                | 1 1 |
  </pre>
  <p>Результат дешифрования в бинарной форме: "1101".</p>
<p><strong>Преимущества</strong></p>
<ul>
<li>Высокий уровень конфиденциальности: Обратная матрица обеспечивает сложность дешифрования без знания ключа.</li>
<li>Математическая стойкость: Применение матриц и их обратных операций делает атаки более сложными.</li>
</ul>

<p><strong>Недостатки</strong></p>
<ul>
<li>Вычислительная сложность: Вычисление обратной матрицы может быть ресурсоемким для больших матриц.</li>
<li>Чувствительность к ошибкам: Маленькие изменения в матрице могут полностью изменить результаты дешифрования.</li>
</ul> 
    </div> 
    </div>   
    </template>
    <script>
    </script>
    <style scoped>
    .container {
      margin-right: 20px;
      margin-left: 20px;
      overflow: auto;
    }
    
    .image {
      float: right;
      margin-right: 20px;
      margin-left: 20px;
      max-width: 40%;
    }
    .title {
        font-size: 36px;
        font-weight: bold;
        margin-bottom: 16px;
        text-align: center;
    }
    
    .text {
      font-size: 18px;
      line-height: 1.5;
      text-align: left;
    }
    </style>