<template>
    <div class="container">
    <h1 class="title">Криптосистема RSA</h1>
    <img class="image" src="@/assets/ShifrAssets/RSA.png">
    <div class="text">
    <p>RSA является одним из самых известных алгоритмов асимметричного шифрования, что означает, что у него есть два ключа: публичный и приватный. Публичный ключ используется для шифрования данных, в то время как приватный ключ используется для их дешифрования.</p>
    
    <h2>Термины:</h2>
    <p><strong>Публичный ключ (Public Key):</strong> Этот ключ используется для шифрования данных и распространяется всем.</p>
    <p><strong>Приватный ключ (Private Key):</strong> Этот ключ используется для дешифрования данных и должен храниться в тайне.</p>
    <p><strong>Шифрование (Encryption):</strong> Процесс преобразования исходных данных в неразборчивый формат с использованием публичного ключа.</p>
    <p><strong>Дешифрование (Decryption):</strong> Процесс преобразования зашифрованных данных обратно в исходный вид с использованием приватного ключа.</p>
    
    <h2>Алгоритм RSA:</h2>
    <h3>Генерация ключей:</h3>
    <ol>
        <li>Выберите два больших случайных простых числа: <em>p</em> и <em>q</em>.</li>
        <li>Вычислите их произведение: <em>n</em> = <em>p</em> * <em>q</em>.</li>
        <li>Вычислите функцию Эйлера от <em>n</em>: φ(<em>n</em>) = (<em>p</em>-1) * (<em>q</em>-1).</li>
        <li>Выберите случайное целое число <em>e</em> такое, что 1 &lt; <em>e</em> &lt; φ(<em>n</em>), и <em>e</em> взаимно просто с φ(<em>n</em>).</li>
        <li>Вычислите число <em>d</em>, обратное к <em>e</em> по модулю φ(<em>n</em>), то есть <em>d</em> * <em>e</em> ≡ 1 (mod φ(<em>n</em>)).</li>
        <li>Ваш публичный ключ: (<em>n</em>, <em>e</em>).</li>
        <li>Ваш приватный ключ: (<em>n</em>, <em>d</em>).</li>
    </ol>

    <h3>Шифрование:</h3>
    <ol>
        <li>Преобразуйте сообщение в числовое значение <em>m</em>.</li>
        <li>Зашифруйте <em>m</em> с использованием публичного ключа (<em>n</em>, <em>e</em>) по формуле: <em>c</em> ≡ <em>m</em><sup><em>e</em></sup> (mod <em>n</em>).</li>
    </ol>

    <h3>Дешифрование:</h3>
    <ol>
        <li>Зашифрованный текст <em>c</em> дешифруется с использованием приватного ключа (<em>n</em>, <em>d</em>) по формуле: <em>m</em> ≡ <em>c</em><sup><em>d</em></sup> (mod <em>n</em>).</li>
    </ol>

    <h2>Пример работы алгоритма RSA:</h2>
    <h3>Генерация ключей:</h3>
    <p>Пусть <em>p</em> = 17 и <em>q</em> = 19. Тогда <em>n</em> = 17 * 19 = 323, а φ(<em>n</em>) = 16 * 18 = 288.</p>
    <p>Пусть <em>e</em> = 5 (заметьте, что 5 и 288 взаимно просты).</p>
    <p>Вычисляем <em>d</em>: 5 * <em>d</em> ≡ 1 (mod 288). Значит, <em>d</em> = 173.</p>
    <p>Публичный ключ: (323, 5). Приватный ключ: (323, 173).</p>

    <h3>Шифрование:</h3>
    <p>Пусть сообщение <em>m</em> = 123.</p>
    <p>Зашифрованное сообщение <em>c</em> = 123<sup>5</sup> % 323 = 86533 % 323 = 13.</p>

    <h3>Дешифрование:</h3>
    <p>Расшифрованное сообщение <em>m</em> = 13<sup>173</sup> % 323 = 123.</p>

    <h2>Плюсы и минусы системы RSA:</h2>
    <h3>Плюсы:</h3>
    <ul>
        <li>Безопасность: Основан на сложности факторизации больших чисел, что делает его криптостойким.</li>
        <li>Аутентификация и подпись: Используется для проверки подлинности данных и создания цифровых подписей.</li>
        <li>Отсутствие обмена секретами: Публичный ключ может быть распространен свободно, а приватный ключ остается в тайне.</li>
    </ul>
    <h3>Минусы:</h3>
    <ul>
        <li>Вычислительная сложность: Операции факторизации и возведения в степень могут быть времязатратными для больших чисел.</li>
        <li>Ресурсоемкость: Большие ключи могут занимать много места и требовать больше вычислительных ресурсов.</li>
        <li>Не подходит для больших объемов данных: RSA медленнее симметричных алгоритмов для шифрования больших объемов данных.</li>
    </ul>  
    </div> 
    </div>   
</template>
    <style scoped>
    .container {
      margin-right: 20px;
      margin-left: 20px;
      overflow: auto;
    }
    
    .image {
      float: right;
      margin-right: 20px;
      margin-left: 20px;
      max-width: 40%;
    }
    .title {
        font-size: 36px;
        font-weight: bold;
        margin-bottom: 16px;
        text-align: center;
    }
    
    .text {
      font-size: 18px;
      line-height: 1.5;
      text-align: left;
    }
    </style>