<template>
    <div class="container">
      <h1 class="title">Групповые коды</h1>
      
      <div class="text">
        <p>
          Передача информации сводится к передаче по некоторому каналу связи символов некоторого алфавита (будем считать алфавит состоящим из двух символов {0,1}). Однако в реальных ситуациях сигналы при передаче практически всегда могут искажаться, и переданный символ бу-дет восприниматься неправильно. 
          Для обеспечения надежности передачи информации в таких системах разработаны эффективные методы, использующие коды различных типов. Далее мы рассмотрим одну из таких моделей, связанную с групповыми кодами, основанными на применении теоремы Лагранжа
          В качестве элементарного сообщения берется упорядоченная последовательность — строка (или двоичное слово) a = (a<sub>1</sub>a<sub>2</sub> ... a<sub>m</sub>) длины m,
          где а<sub>i</sub> = 0 или а<sub>i</sub> = 1
          </p>
          <p> 
            Отметим, что множество всех двоичных слов a = (a<sub>1</sub>a<sub>2</sub> ... a<sub>m</sub>) длины m образует абелеву группу Z<sub>2</sub><sup>m</sup> относительно поразрядного сложения по
            модулю 2. С целью исключения влияния помех (атмосферных разрядов, космических шумов и тд.), способных превратить Ов 1 и обратно, сообщение, подлежащее передаче, кодируется более длинной послед овательностью. символов в алфавите {0,1} по определенной схеме кодирования. Эта последовательность называется кодом или кодовым словом.
            Опишем скему кодирования. Пусть Е — кодирующая m * n — матрица, у которой есть m * m — подматрица с отличным от нуля определителем, например, единичная. Кодирование реализуется операцией b = aE или
          </p>
          <p>
            b<sub>j</sub> = &sum; <sup>m</sup><sub>k=1</sub> (a<sub>k</sub> e<sub>kj</sub>), j = 1,...,n 
          </p>
          <p>
            где e<sub>ij</sub> = 0 или 1. Тогда отображение a — aE переводит группу всех двоичных слов длины m в группу кодовых слов длины n.
          </p>
          <p> 
            Пример : Рассмотрим следующую 3 * 6 матрицу:
          </p>
          <img src = "@/assets/ShifrAssets/grp.png" style="height: 100px;">
          <p> 
            Тогда кодирование задается таким образом:<br>
          000 — 000000,<br>
          001 — 001111,<br>
          010 — 010011,<br>
          011 — 011100,<br>
          100 — 100110,<br>
          101 — 101001,<br>
          110 — 110101,<br>
          111 — 111010.<br>
          </p>
          <p> 
          Схема декодирования исходит из группы G всех слов, которые могут быть приняты (|G| = 2<sup>n</sup>). Так как кодовые слова H образуют нормальную (нормальность следует из коммутативности G) подгруппу G. 
          Будем записывать в одну строку те элементы G, которые являются членами одного смежного класса G по H. Первая строка, соответствующая нулевому слову из G, будет тогда всеми кодовыми словами из H, т.е.<br>
          {h<sub>0</sub>,h<sub>1</sub>,...,h<sub>2<sup>m</sup>-1</sub>}
          </p>
          <p> 
            В общем случае, если g<sub>i</sub> &isin; G, g<sub>i</sub> &notin; H, то строка, содержащая g<sub>i</sub> (смежный класс g<sub>i</sub> + H) имест вид<br>
            {g<sub>i</sub> + h<sub>0</sub>, g<sub>i</sub> + h<sub>1</sub>,..., g<sub>i</sub> + h<sub>2<sup>m</sup>-1</sub>}<br>
            Лидером каждого из таких построенных смежных классов называется слово минимального веса, Весом называется число единиц в слове.
            Таким образом, имеет место следующее разложение G:
          </p>
          <p> 
          H = {0, h<sub>1</sub>, h<sub>2</sub>,..., h<sub>2<sup>m</sup>-1</sub>},<br>
          g<sub>1</sub> + H = {g<sub>1</sub>, g<sub>1</sub> + h<sub>1</sub>, g<sub>1</sub> + h<sub>2</sub>,..., g<sub>1</sub> + h<sub>2<sup>m</sup>-1</sub>},<br>
          g<sub>2</sub> + H = {g<sub>2</sub>, g<sub>2</sub> + h<sub>1</sub>, g<sub>2</sub> + h<sub>2</sub>,..., g<sub>2</sub> + h<sub>2<sup>m</sup>-1</sub>},<br>
          .................................................................<br>
          g<sub>2<sup>n-m</sup>-1</sub> + H = {g<sub>2<sup>n-m</sup>-1</sub>, g<sub>2<sup>n-m</sup>-1</sub> + h<sub>1</sub>,..., g<sub>2<sup>n-m</sup>-1</sub> + h<sub>2<sup>m</sup>-1</sub>},<br>
          </p>
          <p> 
          где g<sub>i</sub> &isin; G - лидер соответствующего смежного класса.
          Отметим, что строки попарно либо не пересекаются, либо совлада-
          ют, множество смежных классов группы образуют:
          фактор-группу G/H, число строк будет 2<sup>n-m</sup> ‚ следует из теоремы Лагранжа, так как 2<sup>n-m</sup> — это порядок фактор-группы |G/H|= |G|/|H|, а |H| = 2<sup>m</sup>
          </p>
          <p>
          Таблица, составленная из элементов g = g<sub>i</sub> + h<sub>j</sub>, i = 0,...,2<sup>n-m</sup> - 1, j = 0,...,2<sup>m</sup> - 1 , называется таблицей декодирования.
          Декодирование слова g = g<sub>i</sub> + h<sub>j</sub> состоит в выборе кодового слова h<sub>j</sub> в качестве переданного и последующем применении операции, обратной умножению на Е. Такая схема декодирования может исправлять ошибки.
          </p>
          <p>
          Для кода из рассматриваемого примера таблица
          декодирования будет следующей:<br>
          000000 001111 010011 011100 100110 101001 110101 111010<br>
          100000 101111 110011 111100 000110 001001 010101 011010<br>
          010000 011111 000011 001100 110110 011001 100101 101010<br>
          001000 000111 011011 010100 101110 100001 111101 110010<br>
          000100 001011 010111 011000 100010 101101 110001 111110<br>
          000010 001101 010001 011110 100100 101011 110111 111000<br>
          000001 001110 010010 011101 100111 101000 110100 111011<br>
          000101 001010 010110 011001 100011 101100 110000 111111<br>
          </p>
          <p>
          Первая строка в ней — это строка кодовых слов, а первый столбец — это лидеры
          Например, если принято слово 110011 (2-я строка, 3-й столбец таб-
          лицы), то считается, что было передано слово 010011; аналогично, если принято слово 100101 (3-я строка, 7-й столбец таблицы), переданным считается слово 110101, и т.д.
          </p>
      </div>
    </div>
  </template>
  
  <style scoped>
  .container {
    margin-right: 20px;
    margin-left: 20px;
    overflow: auto;
  }
  
  .image {
    float: right;
    margin-right: 20px;
    margin-left: 20px;
    max-width: 40%;
  }
  .title {
      font-size: 36px;
      font-weight: bold;
      margin-bottom: 16px;
      text-align: center;
  }
  
  p {
  margin-top: 2%;
  
  }
  .text {
    font-size: 18px;
    line-height: 1.5;
    text-align: left;
  }
  </style>
  