<template>
  <div class="about">
    <h1>О нас</h1>
    <p>
      Добро пожаловать на наш сайт, посвященный методам шифрования и дешифрования! Мы увлечены криптографией и стремимся
      предоставить вам знания и инструменты для понимания и использования различных методов шифрования.
    </p>

    <h2>Наша миссия</h2>
    <p>
      Наша миссия - обучить и повысить людям интерес к такой науке как криптография. Мы стремимся объяснить основные
      концепции шифрования и дешифрования, исследовать различные алгоритмы и продемонстрировать практические
      применения криптографии в современном цифровом мире.
    </p>

    <h2>Калькулятор для решения шифра</h2>
    <p>
      Одна из ключевых особенностей нашего сайта - калькулятор для решения шифра. С его помощью вы можете ввести
      текст и выбрать нужный вам метод взаимодействия. Наш калькулятор применит
      выбранный алгоритм шифрования или дешифрования и предоставит вам конечный ответ.
    </p>

    <h2>Конфиденциальность и безопасность</h2>
    <p>
      Мы серьезно относимся к вашей конфиденциальности и безопасности. Мы стремимся предоставить точную и актуальную
      информацию о методах шифрования и пропагандировать ответственное использование криптографии. Мы призываем вас
      понимать юридические и этические аспекты, связанные с шифрованием, и уважать права на конфиденциальность других
      людей.
    </p>

    <h2>Участие</h2>
    <p>
      Если у вас есть вопросы, предложения или отзывы, мы будем рады услышать вас. Вы можете связаться с нами через
      контактную форму на нашем сайте. Мы также приветствуем вклад от сообщества криптографов. Если вы хотите внести
      свою статью, учебник или инструмент, связанный с шифрованием, пожалуйста, свяжитесь с нами.
    </p>

    <h2>Спасибо</h2>
    <p>
      Мы хотели бы выразить огромную благодарность всем участникам, исследователям и энтузиастам, которые помогли создать этот
      ценный ресурс для сообщества криптографии. Ваша поддержка очень важна для нас! &#10084;
    </p>
  </div>
</template>

<script>
export default {
  name: 'AboutPage',
};
</script>

<style scoped>
.about {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
}

h1 {
  font-size: 32px;
  margin-bottom: 20px;
}

h2 {
  font-size: 24px;
  margin-top: 30px;
  margin-bottom: 10px;
}

p {
  font-size: 18px;
  line-height: 1.5;
  margin-bottom: 20px;
}
</style>
