<template>
    <div class="container">
    <h1 class="title">Шифр Цезаря</h1>
    <img class="image" src="@/assets/ShifrAssets/Caesar.png">
    <div class="text">
        <p>Шифр Цезаря - это один из самых простых видов шифрования, используемых в криптографии. Он назван в честь Римского императора Цезаря, который, по преданию, использовал этот метод для защиты своих личных сообщений.</p>

<h2>Анализ алгоритма</h2>
<p>Шифр Цезаря основан на простом принципе сдвига букв в алфавите. Каждая буква заменяется другой буквой, находящейся на определенном количестве позиций в алфавите. Это количество позиций называется ключом шифрования.</p>
<p>Процесс шифрования включает следующие этапы:</p>
<ol>
    <li>Выбор ключа: Выберите число, на которое будут сдвигаться буквы в алфавите. Например, если выбран ключ 3, каждая буква будет заменена на букву, находящуюся на 3 позиции вперед от нее.</li>
    <li>Разбиение текста: Разбейте исходный текст на отдельные буквы или символы.</li>
    <li>Шифрование: Для каждой буквы выполните сдвиг на заданное количество позиций вперед по алфавиту. Обратите внимание, что алфавит можно рассматривать как зацикленный, то есть после буквы 'Z' следует буква 'A'.</li>
    <li>Сборка шифртекста: Соберите зашифрованные буквы вместе, чтобы получить зашифрованный текст.</li>
</ol>

<h2>Пример работы алгоритма</h2>
<p>Давайте рассмотрим пример шифрования фразы "HELLO" с ключом 3:</p>
<p>Исходный текст: HELLO<br>
Ключ: 3<br>
Шифрование:</p>
<pre>
H -&gt; K
E -&gt; H
L -&gt; O
L -&gt; O
O -&gt; R
</pre>
<p>Зашифрованный текст: "KHOOR"</p>

<h2>Плюсы и минусы</h2>
<p><strong>Плюсы:</strong></p>
<ul>
    <li>Простота: Шифр Цезаря - один из самых простых способов шифрования.</li>
    <li>Интуитивность: Легко понять и реализовать даже без глубоких знаний криптографии.</li>
    <li>Быстрота: Шифрование и дешифрование выполняются очень быстро.</li>
</ul>
<p><strong>Минусы:</strong></p>
<ul>
    <li>Низкая стойкость: Из-за малого количества возможных ключей (равного количеству букв в алфавите), шифр легко подвергается атакам методом перебора.</li>
    <li>Предсказуемость: Сдвиг на постоянное количество позиций делает шифр очевидным и подверженным частотному анализу.</li>
</ul>

<p>В целом, шифр Цезаря - это хороший пример простого шифрования, который может использоваться для обучения основам криптографии, но не является надежным для защиты конфиденциальной информации.</p>

    </div> 
    </div>   
    </template>
    <script>
    </script>
    <style scoped>
    .container {
      margin-right: 20px;
      margin-left: 20px;
      overflow: auto;
    }
    
    .image {
      float: right;
      margin-right: 20px;
      margin-left: 20px;
      max-width: 40%;
    }
    .title {
        font-size: 36px;
        font-weight: bold;
        margin-bottom: 16px;
        text-align: center;
    }
    
    .text {
      font-size: 18px;
      line-height: 1.5;
      text-align: left;
    }
    </style>