<template>
    <div class="container">
    <h1 class="title">Криптосистема на псевдослучайных числах</h1>
    <div class="warning-box">
        <div class="warning-title">Предупреждение:</div>
        <div class="warning-text">В этой статье рассматривается генерация псевдослучайных чисел на системе регистра сдвига.</div>
        </div>
    <img class="image" src="@/assets/ShifrAssets/RandomGen.jpg">
    <div class="text">
        
    <p>Криптосистема на регистре сдвига — это классический метод шифрования, основанный на применении линейных регистров сдвига. Она позволяет зашифровать данные путем последовательного применения операции сдвига к битовому регистру. Каждый бит регистра зависит от нескольких предыдущих битов, что делает криптосистему на регистре сдвига недостаточно безопасной для современных стандартов шифрования, но она всё равно является интересной для понимания основ криптографии.</p>

<h3>Этапы алгоритма</h3>
<ol>
  <li><strong>Инициализация:</strong> В начале работы задается начальное состояние регистра (ключ), состоящее из нулей и единиц.</li>
  <li><strong>Сдвиг:</strong> На каждом шаге алгоритма биты регистра сдвигаются на одну позицию влево. При этом бит с самой левой позиции заменяется на результат логической операции XOR (исключающее ИЛИ) над некоторыми битами регистра (элементами обратной связи).</li>
  <li><strong>Генерация ключа:</strong> Бит, который вышел из регистра, используется как зашифрованный/расшифрованный бит (ключ).</li>
</ol>

<h3>Объяснение этапов</h3>

<h4>1. Инициализация</h4>
<p>Выбирается начальное состояние регистра сдвига, представляющее собой набор битов (0 и/или 1).</p>

<h4>2. Сдвиг</h4>
<p>На этом этапе происходит сдвиг всех битов влево. Значение самого левого бита заменяется на результат XOR между определенными битами регистра. Эти биты называются "битами обратной связи" и выбираются заранее.</p>

<h4>3. Генерация ключа</h4>
<p>Бит, который вышел из регистра после сдвига, становится ключевым битом, который может быть использован для шифрования (или расшифрования) данных.</p>

<h1>Пример работы алгоритма с начальным состоянием 100000</h1>
    <p>Предположим, у нас есть начальное состояние регистра: 100000, и биты обратной связи на позициях 6 и 5. Давайте посмотрим на первые несколько шагов алгоритма:</p>
    
    <h2>Инициализация:</h2>
    <p>Начальное состояние регистра - 100000.</p>
    
    <h2>Сдвиг:</h2>
    <p>После сдвига, состояние регистра становится 000001. Бит на позиции 1 (левый бит) будет изменен.</p>
    
    <h2>Генерация ключа:</h2>
    <p>Бит на позиции 6 выходит из регистра, и это становится ключевым битом.</p>
    
    <p>Процесс продолжается далее, генерируя последовательность ключевых битов на основе сдвигов и операций XOR.</p>

<h2>Преимущества и недостатки</h2>

<h3>Преимущества:</h3>
<ul>
  <li>Простота реализации и понимания.</li>
  <li>Быстрая генерация ключей.</li>
</ul>

<h3>Недостатки:</h3>
<ul>
  <li>Низкий уровень безопасности из-за ограниченной сложности алгоритма.</li>
  <li>Легко воспроизводимая последовательность ключей.</li>
</ul>

<p>Криптосистема на регистре сдвига представляет собой простой метод шифрования, основанный на операциях сдвига и логических операциях. Однако из-за ограниченной сложности она не рекомендуется для использования в современных криптографических задачах, где требуется высокий уровень безопасности.</p>
  
    </div> 
    </div>   
    </template>
    <script>
    </script>
    <style scoped>
    .container {
      margin-right: 20px;
      margin-left: 20px;
      overflow: auto;
    }
    
    .image {
      float: right;
      margin-right: 20px;
      margin-left: 20px;
      max-width: 40%;
    }
    .title {
        font-size: 36px;
        font-weight: bold;
        margin-bottom: 16px;
        text-align: center;
    }
    
    .text {
      font-size: 18px;
      line-height: 1.5;
      text-align: left;
    }
    .warning-box {
            border: 2px solid #f2b705;
            background-color: #fff7d7;
            padding: 10px;
            border-radius: 5px;
            margin: 20px;
        }

        .warning-title {
            font-size: 18px;
            font-weight: bold;
            color: #f2b705;
            margin-bottom: 10px;
        }

        .warning-text {
            font-size: 16px;
        }
    </style>