<template>
  <div class="container">
    <h1 class="title">Азбука Морзе</h1>
    <img class="image" src="@/assets/ShifrAssets/Morze.png">
    
    <div class="text">
      <p>
            Азбука Морзе - это система кодирования букв алфавита и цифр с помощью комбинаций точек, тире и пробелов,
            которая используется для передачи текстовых сообщений с помощью телеграфа или других средств связи.
            Азбука Морзе была разработана американским изобретателем Сэмюэлем Морзе и его соавтором Альфредом Вэйлом
            в 1830-х годах и впервые использовалась для передачи электрических сигналов на длинных расстояниях.
        </p>
        <p> 
            Азбука Морзе состоит из комбинаций коротких сигналов, называемых "точками", и длинных сигналов, 
            называемых "тире". Каждая буква алфавита и цифра имеет свой уникальный код Морзе, 
            состоящий из одной или нескольких комбинаций точек и тире. Например, код Морзе для буквы "А" - это ".-". 
            Коды Морзе можно использовать для передачи текстовых сообщений на различных языках, 
            так как они основаны на алфавите и не зависят от конкретного языка.
        </p>
        <p>
            Азбука Морзе была широко использована в телеграфной связи в 19 и 20 веках, 
            и она оставалась одним из основных средств связи в технических приложениях, 
            таких как морская и авиационная связь, до внедрения более современных технологий связи. 
            Однако она до сих пор используется в некоторых специализированных областях, таких как радиолюбительство, 
            поисково-спасательные операции и военная связь.
        </p>
        <p>
            Азбука Морзе также является важным элементом культурного наследия и истории связи, 
            и многие люди по-прежнему интересуются ее изучением и использованием как увлекательным хобби или способом связи
            в экстремальных условиях, когда другие средства связи недоступны.
        </p>
    </div>
  </div>
</template>

<style scoped>
.container {
  margin-right: 20px;
  margin-left: 20px;
  overflow: auto;
}

.image {
  float: right;
  margin-right: 20px;
  margin-left: 20px;
  max-width: 40%;
}
.title {
    font-size: 36px;
    font-weight: bold;
    margin-bottom: 16px;
    text-align: center;
}

p {
margin-top: 2%;

}
.text {
  font-size: 18px;
  line-height: 1.5;
  text-align: left;
}
</style>
